//
// Created by 彭强兵 on 2021/5/10.
//

#ifndef HELLO_ABNORMAL_H
#define HELLO_ABNORMAL_H

#include "linklist.h"

#define MAX_CACHE 16

#define MAX_TYPE 32

#define MAX_WIN_LEN 16
struct rule rules[] =
        {{
                 .title = "高危命令--base64解码后执行", .len = 7, .mod = 16, .type = 4,
                 .syscalls = {{22, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                         //{59, 0, ""},
                              {59, 0, "base64 --decode|base64 -d"},
                              {56, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "反弹shell0", .len = 8, .mod = 15, .type = 1,
                 .syscalls = {{22, 0, ""},
                              {56, 0, ""},
                              {59, 0, ""},
                              {42, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "反弹shell1", .len = 7, .mod = 8, .type = 1,
                 .syscalls = {{22, 0, ""},
                              {56, 0, ""},
                              {42, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "反弹shell2", .len = 11, .mod = 16, .type = 1,
                 .syscalls = {{22, 0, ""},
                              {22, 0, ""},
                              {56, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""},
                              {59, 0, ""},
                              {42, 0, ""}}
         },
         {
                 .title = "反弹shell3", .len = 7, .mod = 16, .type = 1,
                 .syscalls = {{22, 0, ""},
                              {59, 0, ""},
                              {293, 0, ""},
                              {293, 0, ""},
                              {293, 0, ""},
                              {293, 0, ""},
                              {42, 0, ""}}
         },
         {
                 .title = "反弹shell4", .len = 5, .mod = 5, .type = 1,
                 .syscalls = {{42, 0, ""},
                              {33, 0, "0"},
                              {33, 0, "1"},
                              {33, 0, "2"},
                              {59, 0, "/bin/sh"}}
         },
         {
                 .title = "反弹shell5", .len = 10, .mod = 12, .type = 1,
                 .syscalls = {{42, 0, ""},
                              {33, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {56, 0, ""},
                              {56, 0, ""},
                              {22, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "反弹shell6", .len = 5, .mod = 8, .type = 1,
                 .syscalls = {{22, 0, ""},
                              {56, 0, ""},
                              {59, 0, "awk"},
                              {42, 0, ""},
                              {42, 0, ""}}
         },
         {
                 .title = "反弹shell7", .len = 8, .mod = 12, .type = 1,
                 .syscalls = {{22, 0, ""},
                              {56, 0, ""},
                              {59, 0, ""},
                              {42, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "执行 php webshell1", .len = 11, .mod = 15, .type = 2,
                 .syscalls = {{2, 0, ""},
                              {293, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {59, 0, "sh -c"},
                              {102, 0, ""},
                              {102, 0, ""},
                              {102, 0, ""},
                              {102, 0, ""},
                              {102, 0, ""},
                         // {102, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "执行 php webshell2", .len = 9, .mod = 10, .type = 2,
                 .syscalls = {{2, 0, ""},
                              {293, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {59, 0, "sh -c"},
                              {102, 0, ""},
                              {56, 0, ""},
                              {102, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "执行 php webshell3", .len = 13, .mod = 28, .type = 2,
                 .syscalls = {{42, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""},
                              {102, 0, ""},
                              {102, 0, ""},
                              {102, 0, ""},
                              {102, 0, ""},
                              {56, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "执行 jsp webshell", .len = 11, .mod = 13, .type = 2,
                 .syscalls = {{4, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "执行 cgi webshell", .len = 10, .mod = 16, .type = 2,
                 .syscalls = {{56, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""},
                              {22, 0, ""},
                              {22, 0, ""},
                              {56, 0, ""},
                              {33, 0, ""},
                              {59, 0, ""}}
         },
         {
                 .title = "文件时间篡改--utimensat", .len = 3, .mod = 16, .type = 4,
                 .syscalls = {{280, 0, ""}}
         },
         {
                 .title = "文件时间篡改--utime", .len = 3, .mod = 16, .type = 4,
                 .syscalls = {{132, 0, ""}}
         },
         {
                 .title = "文件时间篡改--utimes", .len = 3, .mod = 16, .type = 4,
                 .syscalls = {{235, 0, ""}}
         },
         {
                 .title = "权限维持--redis漏洞利用入侵", .len = 3, .mod = 6, .type = 4,
                 .syscalls = {{80, 0, ""},
                              {74, 0, ""},
                              {82, 0, ""}}
         },
         {
                 .title = "rootkit--隐藏文件、进程或网络连接", .len = 8, .mod = 16, .type = 4,
                 .syscalls = {{231, 0, ""},
                              {61, 0, ""},
                              {61, 0, ""},
                              {15, 0, ""},
                              {228, 0, ""},
                              {39, 0, ""},
                              {228, 0, ""},
                              {228, 0, ""}}
         },
         {
                 .title = "dirtycow", .len = 16, .mod = 16, .type = 4,
                 .syscalls = {{28, 0, ""},
                              {28, 0, ""},
                              {28, 0, ""},
                              {28, 0, ""},
                              {101, 0, ""},
                              {101, 0, ""},
                              {101, 0, ""},
                              {101, 0, ""},
                              {28, 0, ""},
                              {28, 0, ""},
                              {28, 0, ""},
                              {28, 0, ""},
                              {101, 0, ""},
                              {101, 0, ""},
                              {101, 0, ""},
                              {101, 0, ""}}
         }
        };

void full_cmd(const char *buffer, char *fcmd);
void dump(Sysdump *sys, char*header, char *cache, int icache, LinkList *node);

int64_t w_ftell(FILE *x);
FILE *file_open(int do_fseek, char *file);
#endif //HELLO_ABNORMAL_H
